# PYTHON-7. Объединение таблиц

In [24]:
import pandas as pd
rt = pd.read_csv('ratings.csv')
df
# rt.userId.count()

        userId  movieId  rating   timestamp
0            1        1     4.0   964982703
1            1        3     4.0   964981247
2            1        6     4.0   964982224
3            1       47     5.0   964983815
4            1       50     5.0   964982931
...        ...      ...     ...         ...
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

[100836 rows x 4 columns]

In [21]:
mv = pd.read_csv('movies.csv')
mv

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
9737,193581,Black Butler: Book of the Atlantic (2017),Action|Animation|Comedy|Fantasy
9738,193583,No Game No Life: Zero (2017),Animation|Comedy|Fantasy
9739,193585,Flint (2017),Drama
9740,193587,Bungo Stray Dogs: Dead Apple (2018),Action|Animation
9741,193609,Andrew Dice Clay: Dice Rules (1991),Comedy

In [25]:
rt['rating'].min()

0.5

In [26]:
rt['rating'].max()

5.0

## .merge()

In [30]:
# Объединяем таблицы
joined = rt.merge(mv, on='movieId', how='left')
joined

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,1,3,4.0,964981247,Grumpier Old Men (1995),Comedy|Romance
2,1,6,4.0,964982224,Heat (1995),Action|Crime|Thriller
3,1,47,5.0,964983815,Seven (a.k.a. Se7en) (1995),Mystery|Thriller
4,1,50,5.0,964982931,"Usual Suspects, The (1995)",Crime|Mystery|Thriller
...,...,...,...,...,...,...
100831,610,166534,4.0,1493848402,Split (2017),Drama|Horror|Thriller
100832,610,168248,5.0,1493850091,John Wick: Chapter Two (2017),Action|Crime|Thriller
100833,610,168250,5.0,1494273047,Get Out (2017),Horror
100834,610,168252,5.0,1493846352,Logan (2017),Action|Sci-Fi
100835,610,170875,3.0,1493846415,The Fate of the Furious (2017),Action|Crime|Drama|Thriller

In [31]:
# Проверяем совпадение кол-ва строк, чтобы не потерять данные
len(rt)==len(joined)

True

In [108]:
# В текущей версии датасета movies значение movieId = 31 встречается дважды, а movieId = 32 - один раз. 
# Определите, при каких типах объединения датафреймов ratings и movies по столбцу movieId 
# в итоговом датафрейме останутся оба значения movieId, при условии использования следующего синтаксиса:
# ratings.merge(movies, on = 'movieId', how = ...)

# tb = rt.merge(mv, on = 'movieId', how = 'right')
# tb[tb['movieId'] == 32]
# tb.loc[tb['movieId'].isin([31,32])]
import pandas as pd
ratings = pd.read_csv('ratings_example.txt', sep = '\t')
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144

In [109]:
movies = pd.read_csv('movies_example.txt', sep = '\t')
movies.head()

   movieId                                      title                   genres
0       31                    Dangerous Minds (1995)                     Drama
1       32  Twelve Monkeys (a.k.a. 12 Monkeys) (1995)  Mystery|Sci-Fi|Thriller
2       31                    Dangerous Minds (1995)                     Drama

In [114]:
ratings.merge(movies, on = 'movieId', how = 'right')

,userId,movieId,rating,timestamp,title,genres
0,1.0,31,2.5,1.260759e+09,Dangerous Minds (1995),Drama
1,NaN,32,NaN,NaN,Twelve Monkeys (a.k.a. 12 Monkeys) (1995),Mystery|Sci-Fi|Thriller
2,1.0,31,2.5,1.260759e+09,Dangerous Minds (1995),Drama

## Удаление дубликатов

## .drop_duplicates()

In [116]:
movies.drop_duplicates(subset = 'movieId', keep = 'first', inplace = True)
ratings.merge(movies, on = 'movieId', how = 'right')

,userId,movieId,rating,timestamp,title,genres
0,1.0,31,2.5,1.260759e+09,Dangerous Minds (1995),Drama
1,NaN,32,NaN,NaN,Twelve Monkeys (a.k.a. 12 Monkeys) (1995),Mystery|Sci-Fi|Thriller

# Задания

In [118]:
# Наличие товара на склад
items_dict = {

    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 100132, 312394], 

    'vendor': ['Samsung', 'LG', 'Apple', 'Apple', 'LG', 'Apple', 'Samsung', 'Samsung', 'LG', 'ZTE'],

    'stock_count': [54, 33, 122, 18, 102, 43, 77, 143, 60, 19]

}
items_df = pd.DataFrame(items_dict)

# Данные о покупках товаров
purchase_log = {

    'purchase_id': [101, 101, 101, 112, 121, 145, 145, 145, 145, 221],

    'item_id': [417283, 849734, 132223, 573943, 19475, 3294095, 382043, 302948, 103845, 100132], 

    'price': [13900, 5330, 38200, 49990, 9890, 33000, 67500, 34500, 89900, 11400]

}
purchase_df = pd.DataFrame(purchase_log)


'''
    item_id — идентификатор модели (по этому столбцу будем объединять датафреймы)
    vendor — производитель модели
    stock_count — имеющееся на складе количество данных моделей (в штуках)
    purchase_id — идентификатор покупки
    price — стоимость модели в покупке
'''

In [129]:
# Объедините получившиеся датафреймы по столбцу item_id с типом outer.
shop_df = purchase_df.merge(items_df, on='item_id', how='outer')

# Определите, модель с каким item_id есть в статистике продаж purchase_df, 
# но не учтена на складе (подсказка: подумайте, какой датафрейм должен быть "левым", 
# а какой "правым", чтобы получить необходимые данные). Введите ответ в виде целого числа.
# shop_df[shop_df['stock_count'] == 'NaN']
shop_df
# display(shop_df)

    purchase_id  item_id    price   vendor  stock_count
0         101.0   417283  13900.0  Samsung         54.0
1         101.0   849734   5330.0       LG         33.0
2         101.0   132223  38200.0    Apple        122.0
3         112.0   573943  49990.0    Apple         18.0
4         121.0    19475   9890.0       LG        102.0
5         145.0  3294095  33000.0    Apple         43.0
6         145.0   382043  67500.0  Samsung         77.0
7         145.0   302948  34500.0  Samsung        143.0
8         145.0   103845  89900.0      NaN          NaN
9         221.0   100132  11400.0       LG         60.0
10          NaN   312394      NaN      ZTE         19.0

In [131]:
# Сформируйте датафрейм merged, в котором в результате объединения purchase_df и items_df останутся модели, 
# которые учтены на складе и имели продажи. Сколько всего таких моделей?

purchase_df.merge(items_df, on='item_id', how='inner').item_id.count()

9

In [244]:
# Посчитайте объем выручки для каждой модели, которую можно получить, распродав все остатки на складе. 
# Модель с каким item_id имеет максимальное значение выручки после распродажи остатков? 

# Примечание: перемножение столбцов датафрейма можно производить разными способами, 
# но самый простой - перемножение "в лоб" вида df['col1'] = df['col2'] * df['col3']. 
# Для присоединения новых данных к датафрейму тоже можно использовать различные методы, включая функцию .append(), 
# которая позволяет присоединять к датафрейму другой датафрейм, серии или словари.

i = 0
revenue = []
while i < len(shop_df):
    item = shop_df.iloc[i]
    if (item.price == item.price) and (item.stock_count == item.stock_count):
#         revenue[item.item_id] = item.price*item.stock_count   # формируем словарь
        revenue.append([item.item_id, item.price*item.stock_count])   # формируем список
    i += 1

revenue = sorted(revenue, key=lambda x: x[1], reverse=True)
display(revenue)

[[382043, 5197500.0],
 [302948, 4933500.0],
 [132223, 4660400.0],
 [3294095, 1419000.0],
 [19475, 1008780.0],
 [573943, 899820.0],
 [417283, 750600.0],
 [100132, 684000.0],
 [849734, 175890.0]]

In [243]:
# Посчитайте итоговую выручку из прошлого задания по всем моделям. Ответ дайте в виде целого числа.
revenue_sum = 0
for item in revenue:
    revenue_sum += item[1]
revenue_sum

19729490.0

In [295]:
import os
files = os.listdir('data')
display(files)

# Создайте на основе списка files новый список data, в который поместите только файлы, содержащие в названии "txt".
import re
re.compile('[\w.]+txt').findall(' '.join(files))

['ratings_8.txt',
 '.DS_Store',
 'ratings_9.txt',
 'ratings_10.txt',
 'ratings_7.txt',
 'ratings_6.txt',
 'ratings_4.txt',
 'ratings_5.txt',
 'ratings_1.txt',
 'ratings_2.txt',
 'ratings_3.txt']

['ratings_8.txt',
 'ratings_9.txt',
 'ratings_10.txt',
 'ratings_7.txt',
 'ratings_6.txt',
 'ratings_4.txt',
 'ratings_5.txt',
 'ratings_1.txt',
 'ratings_2.txt',
 'ratings_3.txt']